flowOverADisk2D/linearUpwindStabilizedTransportScheme_U1/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | foam-extend: Open Source CFD                    |
|  \\    /   O peration     | Version:     4.0                                |
|   \\  /    A nd           | Web:         http://www.foam-extend.org         |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant/polyMesh";
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

scale 0.01;

vertices
(
    (0 0 0) // 0
    (2 0 0) // 1
    (2 0 -0.1) // 2 
    (0 0 -0.1) // 3
    (0 5 0) // 4
    (2 5 0) // 5
    (2 5 -0.1) // 6
    (0 5 -0.1) // 7
    (6 0 0) // 8
    (6 0 -0.1) // 9
    (3.64644660941 2.14644660941 0) // 10
    (4.35355339059 2.14644660941 0) // 11
    (4.35355339059 2.14644660941 -0.1) // 12
    (3.64644660941 2.14644660941 -0.1) // 13
    (3.64644660941 2.85355339059 0) // 14
    (3.64644660941 2.85355339059 -0.1) // 15
    (4.35355339059 2.85355339059 0) // 16
    (4.35355339059 2.85355339059 -0.1) // 17
    (6 5 0) // 18
    (6 5 -0.1) // 19
    (16 0 0) // 20
    (16 0 -0.1) // 21
    (16 5 0) // 22
    (16 5 -0.1) // 23
);

blocks
(
    hex ( 0  1  2  3  4  5  6  7) (20 1 50) simpleGrading (1 1 1)
    hex (1 10 13  2  5 14 15  6) (50 1 50) simpleGrading (1 1 1) // left
    hex (1  8  9  2 10 11 12 13) (50 1 50) simpleGrading (1 1 1) // bottom
    hex (14 16 17 15  5 18 19  6) (50 1 50) simpleGrading (1 1 1) // top
    hex (11  8  9 12 16 18 19 17) (50 1 50) simpleGrading (1 1 1) // right
    hex (8 20 21  9 18 22 23 19) (100 1 50) simpleGrading (1 1 1)
);

edges
(
    arc 14 10 (3.5 2.5 0)
    arc 15 13 (3.5 2.5 -0.1)
    arc 10 11 (4 2 0)
    arc 12 13 (4 2 -0.1)
    arc 14 16 (4 3 0)
    arc 15 17 (4 3 -0.1)
    arc 16 11 (4.5 2.5 0)
    arc 17 12 (4.5 2.5 -0.1)
);

boundary
(
    inlet
    {
        type patch;
        faces
        (
            ( 0  4  7  3)
        );
    }
    outlet
    {
        type patch;
        faces
        (
            (20 21 23 22)
        );
    }
    upperWalls
    {
        type wall;
        faces
        (
            ( 4  5  6  7)
            ( 5 18 19  6)
            (18 22 23 19)
        );
    }
    lowerWalls
    {
        type wall;
        faces
        (
            ( 0  1  2  3)
            ( 1  8  9  2)
            ( 8 20 21  9)
        );
    }
    cylinderWalls
    {
        type wall;
        faces
        (
            (10 11 12 13)
            (11 16 17 12)
            (14 16 17 15)
            (10 14 15 13)
        );
    }
    frontAndBack
    {
        type empty;
        faces
        (
            ( 0  1  5  4)
            ( 1 10 14  5)
            (14 16 18  5)
            (11  8 18 16)
            ( 1  8 11 10)
            ( 8 20 22 18)

            ( 3  7  6  2)
            ( 2  6 15 13)
            (15  6 19 17)
            (12 17 19  9)
            ( 2 13 12  9)
            ( 9 19 23 21)
        );
    }
);

mergePatchPairs
(
);
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
