flowOverADisk2D/linearUpwindStabilizedTransportScheme_U1/system/stressComponents
type            turbulenceFields;
libs            (fieldFunctionObjects);

writeControl    writeTime;

fields          (devReff);
